app/DataTables/OrderDataTable.php

select `orders`.`restaurant_id` from `orders`
---
    protected function getColumns()

    {

        // $orders = DB::table('orders')

        // ->select('orders.*')->get();





        // $driver_name =DB::table('orders')

        //         ->join('users', 'orders.driver_id', '=', 'users.id')

        //         ->select('users.name')

        //         ->get();

         //print_r($driver_name);die;



        $restaurant_name = DB::table('orders')

        ->select('orders.restaurant_id')->get();