app/Http/Controllers/ContactController.php

      public function showManager(CouponDataTable $couponDataTable)

    {

          $user_id = Auth::user()->id;

 //$contact = $this->contactRepository->where('manager_id',$user_id)->where('role_id','3')->get();
 $contact = DB::table('support')
 ->join('restaurants', 'restaurants.id', '=', 'support.stores')
 ->where('support.manager_id', $user_id)
 ->where('support.stores','!=', 'null')
 ->get();
---
select * from `support` inner join `restaurants` on `restaurants`.`id` = `support`.`stores` where `support`.`manager_id` = 2 and `support`.`stores` != 'null'