app/Http/Controllers/CuisineController.php

select `name`, `id` from `restaurants` where `managerId` = 1
---
    public function create()
    {
        $manager_id=Auth::user()->id;
        //managerId changed to id
        $restaurant = $this->restaurantRepository->where('managerId', $manager_id)->pluck('name', 'id');