app/Http/Controllers/DashboardController.php

select sum(total_earning) as total, YEAR(created_at) as year from `earnings` where `created_at` like '%2021%' order by `id` desc
---


//        dd($ajaxEarningUrl);
        return view('dashboard.index')
            ->with("ajaxEarningUrl", $ajaxEarningUrl)
            ->with("ordersCount", $ordersCount)
            ->with("restaurantsCount", $restaurantsCount)
            ->with("driverCount", $driverCount)
            ->with("managerCount", $managerCount)
             ->with("usersCount", $usersCount)
            ->with("restaurants", $restaurants)
            ->with("manager", $manager)
             ->with("users", $users)
             ->with("manager_details", $manager_details)
            ->with("driver", $driver)
            ->with("membersCount", $membersCount)
            ->with("earning", $earning)
            ->with("login_id", $login_id)
            ->with("yearnings", $yearnings)
            ->with("mearnings", $mearnings)
            ->with("order_status_yearly", $order_status_yearly)
            ->with("order_status_monthly", $order_status_monthly)
            ->with("simple", $simple);