app/Http/Controllers/DashboardController.php


        $ordersCount = $this->orderRepository->count();

        $membersCount = $this->userRepository->where('role_id', '4')->count();
---
select count(*) as aggregate from `users` where `role_id` = '4'


            $usersCount = $this->usersRepository->count();

        $restaurants = $this->restaurantRepository->limit(5)->get();
---
select * from `restaurants` limit 5


                  $manager_details = $this->managerRepository->where('role_id', '3')->limit(5)->get();

                $driver = $this->driverRepository->limit(5)->get();
---
select * from `drivers` limit 5