app/Http/Controllers/EnquiryController.php

    public function index()
    {
       $role_id="";

       // $t = date("H");

        // if ($role_id == "1") {

        //   echo "Admin";
        // }
        // elseif ($role_id == "2") {

        //   echo "Manager";
        // }
        // elseif ($role_id == "3") {
        //   echo "Customer";
        // }
        // else {
        //   echo "Driver";
        // }


      $login_id = \Auth::user()->id;

      // $role_id = "3";
       $enquiries = DB::table("support")->select('*')->orderBy('id', 'DESC')->get();
---
select * from `support` order by `id` desc


    //   print_r($enquiries);   die;

       DB::table('support')->update(['support_status' => 1]);
---
update `support` set `support_status` = 1