app/Http/Controllers/ManagerController.php

  public function add_manager()
  {
        $login_id = \Auth::user()->id;
       $role_id = "3";
       $managers = DB::table("users")->where(["role_id"=>$role_id])->select('*')->get();
---
select * from `users` where (`role_id` = '3')