app/Http/Controllers/OrderController.php

select `users`.`name` from `orders` inner join `users` on `orders`.`driver_id` = `users`.`id`
---
     public function index(OrderDataTable $orderDataTable)
     {

         $driver_name =DB::table('orders')
                ->join('users', 'orders.driver_id', '=', 'users.id')
                ->select('users.name')
                ->get();

select `orders`.`id`, `orders`.`restaurant_name`, `orders`.`created_at`, `order_statuses`.`status`, `orders`.`driver_name`, `orders`.`customer_name` from `orders` inner join `order_statuses` on `orders`.`order_status_id` = `order_statuses`.`id` inner join `drivers` on `orders`.`driver_id` = `drivers`.`id` where `orders`.`order_status_id` = '1' and `orders`.`manager_id` = 1
---
     public function completed_orders(){
         $user_id = Auth::id();
        $completed_orders =DB::table('orders')
                ->join('order_statuses', 'orders.order_status_id', '=', 'order_statuses.id')
               //->join('customers', 'orders.user_id', '=', 'customers.id')
                ->join('drivers', 'orders.driver_id', '=', 'drivers.id')
                ->select('orders.id','orders.restaurant_name', 'orders.created_at','order_statuses.status','orders.driver_name','orders.customer_name')
                ->where ('orders.order_status_id', '=', '1')
                ->where('orders.manager_id', $user_id)
                ->get();

select `orders`.`id`, `orders`.`restaurant_name`, `orders`.`created_at`, `order_statuses`.`status`, `orders`.`driver_name`, `orders`.`customer_name` from `orders` inner join `order_statuses` on `orders`.`order_status_id` = `order_statuses`.`id` inner join `drivers` on `orders`.`driver_id` = `drivers`.`id` where `orders`.`order_status_id` = '1' and `orders`.`manager_id` = 1
---
    public function live_orders(){
         $user_id = Auth::id();
        $live_orders =DB::table('orders')
                ->join('order_statuses', 'orders.order_status_id', '=', 'order_statuses.id')
                ->join('customers', 'orders.customer_id', '=', 'customers.id')
                ->join('drivers', 'orders.driver_id', '=', 'drivers.id')
                ->select('orders.id','orders.restaurant_name', 'orders.created_at','order_statuses.status','orders.driver_name','orders.customer_name')
                ->where ('orders.order_status_id', '=', '4')
                ->where('orders.manager_id', $user_id)
                ->get();
        $live_orders = json_decode( json_encode($live_orders), true);

        return view('orders.live_orders')->with("live_orders", $live_orders);