app/Http/Controllers/PaymentController.php

        $earning = $this->paymentRepository->all()->sum('price');
        $ajaxEarningUrl = route('payments.byMonth',['api_token'=>auth()->user()->api_token]);
        //        dd($ajaxEarningUrl);
        return view('payments.index')
            ->with("ajaxEarningUrl", $ajaxEarningUrl)
            ->with("earning", $earning)
            ->with("login_id", $login_id)
---
select sum(total_earning) as total, YEAR(created_at) as year from `earnings` where `created_at` like '%2021%' order by `id` desc