app/Http/Controllers/PaymentController.php

                $yearnings[] = $yearningss;
            }

        $yearly_order_preparing = DB::table('orders')
        ->select (DB::raw('count(order_status_id) as preparing'))->where('order_status_id', '=', '2')->where('created_at', 'like', '%'.$date.'%')
        ->get();
        $yearly_order_preparing = json_decode( json_encode($yearly_order_preparing), true);
        $yearly_order_preparing  = $yearly_order_preparing[0]['preparing'];
        $yearly_order_completed = DB::table('orders')
        ->select (DB::raw('count(order_status_id) as completed'))->where('order_status_id', '=', '1')->where('created_at', 'like', '%'.$date.'%')
        ->get();
        $yearly_order_completed = json_decode( json_encode($yearly_order_completed), true);
        $yearly_order_completed  = $yearly_order_completed[0]['completed'];
        $yearly_order_ready = DB::table('orders')
        ->select (DB::raw('count(order_status_id) as ready'))->where('order_status_id', '=', '3')->where('created_at', 'like', '%'.$date.'%')
        ->get();
        $yearly_order_ready = json_decode( json_encode($yearly_order_ready), true);
        $yearly_order_ready  = $yearly_order_ready[0]['ready'];
        $yearly_order_onway = DB::table('orders')
        ->select (DB::raw('count(order_status_id) as onway'))->where('order_status_id', '=', '4')->where('created_at', 'like', '%'.$date.'%')
        ->get();
        $yearly_order_onway = json_decode( json_encode($yearly_order_onway), true);
        $yearly_order_onway  = $yearly_order_onway[0]['onway'];
        $yearly_order_delivered = DB::table('orders')
        ->select (DB::raw('count(order_status_id) as delivered'))->where('order_status_id', '=', '5')->where('created_at', 'like', '%'.$date.'%')
        ->get();
        $yearly_order_delivered = json_decode( json_encode($yearly_order_delivered), true);
        $yearly_order_delivered  = $yearly_order_delivered[0]['delivered'];

        $yearly_order_cancelled = DB::table('orders')
        ->select (DB::raw('count(order_status_id) as cancelled'))->where('order_status_id', '=', '6')->where('created_at', 'like', '%'.$date.'%')
        ->get();
---
select count(order_status_id) as preparing from `orders` where `order_status_id` = '2' and `created_at` like '%2022%'
select count(order_status_id) as completed from `orders` where `order_status_id` = '1' and `created_at` like '%2022%'
select count(order_status_id) as ready from `orders` where `order_status_id` = '3' and `created_at` like '%2022%'
select count(order_status_id) as onway from `orders` where `order_status_id` = '4' and `created_at` like '%2022%'
select count(order_status_id) as delivered from `orders` where `order_status_id` = '5' and `created_at` like '%2022%'
select count(order_status_id) as cancelled from `orders` where `order_status_id` = '6' and `created_at` like '%2022%'

        $order_status_yearly['onway'] = $yearly_order_onway;
        $order_status_yearly['delivered'] = $yearly_order_delivered;
        $order_status_yearly['cancelled'] = $yearly_order_cancelled;
        $monthly_order_preparing = DB::table('orders')
        ->select (DB::raw('count(order_status_id) as preparing'))->where('order_status_id', '=', '2')->where('created_at', 'like', '%'.$current_month.'%')
        ->get();
        $monthly_order_preparing = json_decode( json_encode($monthly_order_preparing), true);
        $monthly_order_preparing  = $monthly_order_preparing[0]['preparing'];
        $monthly_order_completed = DB::table('orders')
        ->select (DB::raw('count(order_status_id) as completed'))->where('order_status_id', '=', '1')->where('created_at', 'like', '%'.$current_month.'%')
        ->get();
        $monthly_order_completed = json_decode( json_encode($monthly_order_completed), true);
        $monthly_order_completed  = $monthly_order_completed[0]['completed'];
        $monthly_order_ready = DB::table('orders')
        ->select (DB::raw('count(order_status_id) as ready'))->where('order_status_id', '=', '3')->where('created_at', 'like', '%'.$current_month.'%')
        ->get();
        $monthly_order_ready = json_decode( json_encode($monthly_order_ready), true);
        $monthly_order_ready  = $monthly_order_ready[0]['ready'];
        $monthly_order_onway = DB::table('orders')
        ->select (DB::raw('count(order_status_id) as onway'))->where('order_status_id', '=', '4')->where('created_at', 'like', '%'.$current_month.'%')
        ->get();
        $monthly_order_onway = json_decode( json_encode($monthly_order_onway), true);
        $monthly_order_onway  = $monthly_order_onway[0]['onway'];
        $monthly_order_delivered = DB::table('orders')
        ->select (DB::raw('count(order_status_id) as delivered'))->where('order_status_id', '=', '5')->where('created_at', 'like', '%'.$current_month.'%')
        ->get();
---
select count(order_status_id) as preparing from `orders` where `order_status_id` = '2' and `created_at` like '%2022-12%'
select count(order_status_id) as completed from `orders` where `order_status_id` = '1' and `created_at` like '%2022-12%'
select count(order_status_id) as preparing from `orders` where `order_status_id` = '2' and `created_at` like '%2022%'
select count(order_status_id) as onway from `orders` where `order_status_id` = '4' and `created_at` like '%2022-12%'
select count(order_status_id) as delivered from `orders` where `order_status_id` = '5' and `created_at` like '%2022-12%'

        $order_status_monthly['delivered'] = $monthly_order_delivered;


        $losses =DB::table('orders')
        ->join('payments', 'orders.payment_id', '=', 'payments.id')
        ->select('payments.*')
        ->where ('orders.order_status_id', '=', '6')
        ->where('orders.created_at', 'like', '%'.$date.'%')
        ->get();
---
select `payments`.* from `orders` inner join `payments` on `orders`.`payment_id` = `payments`.`id` where `orders`.`order_status_id` = '6' and `orders`.`created_at` like '%2022%'