app/Http/Controllers/PrivacyController.php

    public function index()
    {


       $privacy = DB::table("privacy")->select('*')->get();
---
select * from `privacy`

    public function create()
    {
        $hasCustomField = in_array($this
        ->PrivacyRepository
        ->model() , setting('custom_field_models', []));

           return view('privacy.create')->with('customFields', $hasCustomField);
---
select * from `privacy`

  public function edit($id)
  {
    $privacies = $this->PrivacyRepository->where('id',$id)->get();
    $privacy = $this->PrivacyRepository->findWithoutFail($id);
    if (empty($privacy)) {
        Flash::error(__('lang.not_found'));

        return redirect(route('terms.index'));
    }
    $customFieldsValues = $privacy->customFieldsValues()->with('customField')->get();
---
select * from `privacy` where `id` = 1
select * from `privacy`

  public function update($id, Request $request)
{

     $content = $request->content;


      $privacy = DB::table("privacy")->where('id', $id)->update(['content' => $content]);

       $privacy = DB::table("privacy")->select('*')->get();
---
update `privacy` set `content` = '<p>sqdfsdfqf updated</p>' where `id` = '1'
select * from `privacy`