app/Http/Controllers/RestaurantController.php

select count(*) as aggregate from `user_restaurants` inner join `restaurants` on `restaurants`.`id` = `user_restaurants`.`restaurant_id` where `user_id` = 1
select * from `vendors`
---
    public function create()
    {
        $user_id = Auth::user()->id;
        $has_restaurant = DB::table('user_restaurants')->select('restaurant_id', 'user_id', 'restaurants.name')
            ->join('restaurants', 'restaurants.id', '=', 'user_restaurants.restaurant_id')
            ->where('user_id', $user_id)->count();
        //print_r($has_restaurant);die;
        /*if ($has_restaurant == 1) {
        Flash::error(__('lang.already_registred', ['operator' => __('lang.restaurant')]));
        return redirect()->back()->with('already has registered for restaurant');
        } else {*/
        $user = $this
            ->userRepository
            ->getByCriteria(new ManagersCriteria())
            ->pluck('name', 'id');
        $drivers = $this
            ->userRepository
            ->getByCriteria(new DriversCriteria())
            ->pluck('name', 'id');
        $vendors = DB::table("vendors")->get();

insert into `restaurants` (`name`, `email`, `vendor_name`, `description`, `address`, `latitude`, `longitude`, `phone`, `mobile`, `information`, `opening_time`, `closing_time`, `working_days`, `admin_commission`, `closed`, `active`, `available_for_delivery`) values ('test011', 'manager123456@demo.com', 'Supermarket', '<p>10</p>', '<p>hgdfhfd</p>', '1212', '1212', '123456', '123456', '<p>10</p>', '10 AM', '10 AM', 'Sunday', '12', '0', '0', '1')
---
                ->model());
            try
            {
                $restaurant = $this
                    ->restaurantRepository
                    ->create($input);