app/Http/Controllers/RestaurantController.php

select `managerId` from `restaurants`
---
    public function index(RestaurantDataTable $restaurantDataTable)
    {

         $user_id = Auth::user()->id;

         $manager_id = DB::table("restaurants")->pluck('managerId')->first();

select count(*) as aggregate from `user_restaurants` inner join `restaurants` on `restaurants`.`id` = `user_restaurants`.`restaurant_id` where `user_id` = 2
select * from `restaurants`
select * from `vendors`
---
    public function create()
    {
         $user_id = Auth::user()->id;
 		 $has_restaurant = DB::table('user_restaurants')
         ->select('restaurant_id','user_id','restaurants.name')
         ->join('restaurants', 'restaurants.id', '=', 'user_restaurants.restaurant_id')
         ->where('user_id', $user_id)
         ->count();
		//print_r($has_restaurant);die;
 	  /*if ($has_restaurant == 1) {
         Flash::error(__('lang.already_registred', ['operator' => __('lang.restaurant')]));
           return redirect()->back()->with('already has registered for restaurant');
       } else {*/
       $user = $this->userRepository->getByCriteria(new ManagersCriteria())->pluck('name', 'id');

       $drivers = $this->userRepository->getByCriteria(new DriversCriteria())->pluck('name', 'id');

       $vendors=DB::table("vendors")->get();

select `name` from `users` where `id` = 1
select `restaurant_id`, `user_id`, `restaurants`.`name` from `user_restaurants` inner join `restaurants` on `restaurants`.`id` = `user_restaurants`.`restaurant_id` where `user_id` = 1
select * from `vendors`
---
    public function store(CreateRestaurantRequest $request)
    {
		$user_id = Auth::user()->id;
        $manager_id = $user_id;
        $manager_name = DB::table('users')->where('id', $manager_id)->pluck('name')->first();

//dd($manager_name);


		 $has_restaurant = DB::table('user_restaurants')
        ->select('restaurant_id','user_id','restaurants.name')
        ->join('restaurants', 'restaurants.id', '=', 'user_restaurants.restaurant_id')
        ->where('user_id', $user_id)
        ->get();
        if (is_null($has_restaurant)) {
           Flash::error(__('lang.already_registred', ['operator' => __('lang.restaurant')]));
           return redirect()->back()->with('already has registered for restaurant');
      } else {


        $vendors=DB::table("vendors")->get();

insert into `users` (`name`, `email`, `role_id`, `password`, `api_token`, `updated_at`, `created_at`) values ('test011', 'manager123456@demo.com', '3', 'y$qnmeBmbV3cD7vm0p6TB1M.ffzyc0tfzEQ1kZXUjEQWcJ9jxfHF5OG', 'U1ZHKgwhpRLGXc73yopdpftNyhZ67NJJNyFoYB9ZQCavEX5NhGArB2XfEDTY', '2022-12-03 23:24:13', '2022-12-03 23:24:13')
---
        $user->role_id = "3";
        $user->password = Hash::make($request->password);
        $user->api_token = str_random(60);
        $a=$user->save();

select `id` from `users` where `email` = 'manager123456@demo.com' limit 1
---
        $restaurant_password = $input['password'];


        $user_table_id = DB::table('users')->select('id')->where('email', $restaurant_email)->first();

select `id` from `restaurants` where `email` = 'manager123456@demo.com' limit 1
insert into `user_restaurants` (`user_id`, `restaurant_id`) values (1, 35)
---
         $sm = DB::table("restaurants")->insert(["name"=>$name,"email"=>$email,"vendor_name"=>"Supermarket", "description"=>$description,
     "address"=>$address, "latitude"=>$latitude, "longitude"=>$longitude, "phone"=>$phone, "mobile"=>$mobile, "information"=>$information, "opening_time"=>$opening_time, "closing_time"=>$closing_time, "working_days"=>$working_days,
   /*"restaurant_comission"=>$restaurant_comission,*/ "admin_commission"=>$admin_commission, /*"delivery_fee"=>$delivery_fee, "delivery_range"=>$delivery_range, "default_tax"=>$default_tax,*/ "closed"=>$closed, "active"=>$active, "available_for_delivery"=>$available_for_delivery]);
   $restaurant_id = DB::table('restaurants')->select('id')->where("email",$restaurant_email)->first();


   //select the last using email
   $ms=DB::table("user_restaurants")->insert(["user_id"=>$user_id,"restaurant_id"=>$restaurant_id->id]);

select * from `vendors`
---
    public function edit($id)
    {
        $this->restaurantRepository->pushCriteria(new RestaurantsOfUserCriteria(auth()->id()));
        $restaurant = $this->restaurantRepository->findWithoutFail($id);

        if (empty($restaurant)) {
            Flash::error(__('lang.not_found', ['operator' => __('lang.restaurant')]));
            return redirect(route('restaurants.index'));
        }
        if($restaurant['active'] == 0){
            $user = $this->userRepository->getByCriteria(new ManagersClientsCriteria())->pluck('name', 'id');
        } else {
        $user = $this->userRepository->getByCriteria(new ManagersCriteria())->pluck('name', 'id');
        }
        $drivers = $this->userRepository->getByCriteria(new DriversCriteria())->pluck('name', 'id');
        $cuisine = $this->cuisineRepository->pluck('name', 'id');


        $usersSelected = $restaurant->users()->pluck('users.id')->toArray();


        $driversSelected = $restaurant->drivers()->pluck('users.id')->toArray();

        $cuisinesSelected = $restaurant->cuisines()->pluck('cuisines.id')->toArray();

//   vendors------------field  //
        $vendors=DB::table("vendors")->get();

select `working_days` from `restaurants` where `id` = '10'
---



        $daysSelected = DB::table('restaurants')->where('id', $id)->pluck('working_days');