app/Http/Controllers/TrackController.php

    public function index(OrderDataTable $orderDataTable)
    {
          if (auth()->user()->hasRole('admin')) {
            $user_id = Auth::user()->id;
            $track = DB::table('orders')
            ->select('orders.id','restaurant_name', 'manager_name','status','delivery_fee','payment_id','active','orderStatus')
            ->join('order_statuses', 'order_statuses.id', '=', 'orders.order_status_id')
            ->get();
             $track = json_decode( json_encode($track), true);
            return view('track.index')->with("track", $track);
        }

        else if((auth()->user()->hasRole('manager'))){
           $user_id = Auth::user()->id;
           $track = DB::table('orders')
            ->select('orders.id','restaurant_name', 'manager_name','status','delivery_fee','payment_id','active','orderStatus')
            ->join('order_statuses', 'order_statuses.id', '=', 'orders.order_status_id')
            ->where('orders.manager_id', $user_id)
            ->get();
             $track = json_decode( json_encode($track), true);
         return view('track.index')->with("track", $track)->with("user_id", $user_id);
        }
        else if((auth()->user()->hasRole('client'))){
             $user_id = Auth::user()->id;
           $track = DB::table('orders')
            ->select('orders.id','restaurant_name', 'manager_name','status','delivery_fee','payment_id','active','orderStatus')
            ->join('order_statuses', 'order_statuses.id', '=', 'orders.order_status_id')
            ->where('orders.restaurant_id', $user_id)
            ->get();
---
select `orders`.`id`, `restaurant_name`, `manager_name`, `status`, `delivery_fee`, `payment_id`, `active`, `orderStatus` from `orders` inner join `order_statuses` on `order_statuses`.`id` = `orders`.`order_status_id` where `orders`.`restaurant_id` = 3